src/bsl/Documents/гкс_ВнешняяПроба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ВнешняяПроба</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWarehouse</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПродукцияWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДКомпозитнойПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сюрвейер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма MD5</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнспекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетныйВидПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КачественныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПробы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательВнешний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовWarehouse</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Показатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтанцияОтправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сюрвейер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элеватор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Catalogs/гкс_ПродукцияWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_ПродукцияWarehouse</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКороткоеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWarehouse</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/гкс_ПоказателиКачестваWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_ПоказателиКачестваWarehouse</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стандарт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависимыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиКачестваWarehouse</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерхнийПределЗависимогоПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижнийПределЗависимогоПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодWarehouse</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWarehouse</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Documents/гкс_ВнешняяПроба/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вычисляет контрольную сумму документа для защиты от несанкционированных изменений
//
// Возвращаемое значение:
//   Строка - контрольная сумма документа
//
Функция КонтрольнаяСуммаДокумента() Экспорт

	КонтролируемыеДанные = Новый Структура;
	КонтролируемыеДанные.Вставить("Дата", 			Дата);
	КонтролируемыеДанные.Вставить("ДатаПогрузки", 	ДатаПогрузки);
	КонтролируемыеДанные.Вставить("ДатаИзменения", 	ДатаИзменения);

	КонтролируемыеДанные.Вставить("Номенклатура", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
								НоменклатураWarehouse, "ИдентификаторWarehouse"));

    КонтролируемыеДанные.Вставить("НомерТС", 		НомерТС);
	КонтролируемыеДанные.Вставить("ИДКомпозитнойПробы", ИДКомпозитнойПробы);
	КонтролируемыеДанные.Вставить("ИДПробы", 			ИДПробы);
	КонтролируемыеДанные.Вставить("НомерЗаявки", 		НомерЗаявки);
	КонтролируемыеДанные.Вставить("НомерДокумента", 	НомерДокумента);

	ТабЧастьПоказатели = КачественныеПоказатели.Выгрузить(, "ВидПробы, ПоказательВнешний, Значение");
	КонтролируемыеДанные.Вставить("КачественныеПоказатели",
									ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЧастьПоказатели));

	Возврат Документы.гкс_ВнешняяПроба.КонтрольнаяСумма(КонтролируемыеДанные);

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонтрольнаяСумма = КонтрольнаяСуммаДокумента();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	//гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область СообщенияWarehouse

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ТранспортноеСредство(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = Справочники.ТранспортныеСредства.ТранспортноеСредствоПоНомеру(ПолученноеЗначение);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияОтправления(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		НаименованиеОбъекта = "";
		ПолученныеДанные.Свойство("stationName", НаименованиеОбъекта);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.СтанцияОтправления, НаименованиеОбъекта);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_СтанцияНазначения(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		НаименованиеОбъекта = "";
		ПолученныеДанные.Свойство("stationDestName", НаименованиеОбъекта);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение, Перечисления.гкс_ТипыОбъектовWarehouse.СтанцияНазначения, НаименованиеОбъекта);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_Сюрвейер(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.Сюрвейер, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_Организация(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.Организация, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_НоменклатураWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;
	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ПолноеИмяОбъектаСвойства = "Справочник.гкс_ПродукцияWarehouse";
		ДанныеЗаполненияСвойства = Новый Структура;
		ДанныеЗаполненияСвойства.Вставить(Справочники.гкс_ПродукцияWarehouse.ИмяКлючевогоСвойства(),
			ПолученноеЗначение);
		ДанныеЗаполненияСвойства.Вставить("НаименованиеКороткое", ПолученныеДанные.goodShortName);
		ДанныеЗаполненияСвойства.Вставить("Наименование", ПолученныеДанные.goodName);

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.ЭлементПоВнешнимДанным(ПолноеИмяОбъектаСвойства,
			ПолученноеЗначение, ДанныеЗаполненияСвойства);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ВидПробы(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаИБПоСоотвествиюИдентификаторов(
			ПолученноеЗначение.id, Перечисления.гкс_ТипыОбъектовWarehouse.ВидПробы, ПолученноеЗначение.name);

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		Иначе
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации,
				Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Правило конвертации в реквизит
//
// Параметры:
//  ПравилоКонвертации - СтрокаТаблицыЗначений - Правило конвертации
//  ПолученныеДанные - Структура - данные полученные из Warehouse
//  ДанныеЗаполнения - Структура -  Данные заполнения
//
Процедура ПКС_ПоказательКачестваWarehouse(ПравилоКонвертации, ПолученныеДанные, ДанныеЗаполнения) Экспорт

	Перем ПолученноеЗначение;

	Если ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ПолученноеЗначение) Тогда

		ЗначениеЗаполнения = гкс_ОбменДаннымиWarehouse.СсылкаНаОбъектПоИдентификатору(ПолученноеЗначение,
		  "Справочник.гкс_ПоказателиКачестваWarehouse");

		Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
